project-chip/connectedhomeip/examples/platform/stm32/common/STM32WB5MM-DK/STM32_WPAN/App/app_ble.c
/* USER CODE BEGIN Header */
/**
 ******************************************************************************
 * @file    app_ble.c
 * @author  MCD Application Team
 * @brief   BLE Application
 ******************************************************************************
 * @attention
 *
 * Copyright (c) 2019-2021 STMicroelectronics.
 * All rights reserved.
 *
 * This software is licensed under terms that can be found in the LICENSE file
 * in the root directory of this software component.
 * If no LICENSE file comes with this software, it is provided AS-IS.
 *
 ******************************************************************************
 */
/* USER CODE END Header */

/* Includes ------------------------------------------------------------------*/
#include "app_common.h"

#include "app_ble.h"
#include "ble.h"
#include "dbg_trace.h"
#include "tl.h"

#include "app_matter.h"
#include "cmsis_os.h"
#include "otp.h"
#include "shci.h"
#include "stm32_lpm.h"
#include "timers.h"

/* Private includes ----------------------------------------------------------*/
/* USER CODE BEGIN Includes */

/* USER CODE END Includes */

/* Private typedef -----------------------------------------------------------*/

/**
 * security parameters structure
 */
typedef struct _tSecurityParams
{
    /**
     * IO capability of the device
     */
    uint8_t ioCapability;

    /**
     * Authentication requirement of the device
     * Man In the Middle protection required?
     */
    uint8_t mitm_mode;

    /**
     * bonding mode of the device
     */
    uint8_t bonding_mode;

    /**
     * Flag to tell whether OOB data has
     * to be used during the pairing process
     */
    uint8_t OOB_Data_Present;

    /**
     * OOB data to be used in the pairing process if
     * OOB_Data_Present is set to TRUE
     */
    uint8_t OOB_Data[16];

    /**
     * this variable indicates whether to use a fixed pin
     * during the pairing process or a passkey has to be
     * requested to the application during the pairing process
     * 0 implies use fixed pin and 1 implies request for passkey
     */
    uint8_t Use_Fixed_Pin;

    /**
     * minimum encryption key size requirement
     */
    uint8_t encryptionKeySizeMin;

    /**
     * maximum encryption key size requirement
     */
    uint8_t encryptionKeySizeMax;

    /**
     * fixed pin to be used in the pairing process if
     * Use_Fixed_Pin is set to 1
     */
    uint32_t Fixed_Pin;

    /**
     * this flag indicates whether the host has to initiate
     * the security, wait for pairing or does not have any security
     * requirements.\n
     * 0x00 : no security required
     * 0x01 : host should initiate security by sending the slave security
     *        request command
     * 0x02 : host need not send the clave security request but it
     * has to wait for paiirng to complete before doing any other
     * processing
     */
    uint8_t initiateSecurity;
} tSecurityParams;

/**
 * global context
 * contains the variables common to all
 * services
 */
typedef struct _tBLEProfileGlobalContext
{

    /**
     * security requirements of the host
     */
    tSecurityParams bleSecurityParam;

    /**
     * gap service handle
     */
    uint16_t gapServiceHandle;

    /**
     * device name characteristic handle
     */
    uint16_t devNameCharHandle;

    /**
     * appearance characteristic handle
     */
    uint16_t appearanceCharHandle;

    /**
     * connection handle of the current active connection
     * When not in connection, the handle is set to 0xFFFF
     */
    uint16_t connectionHandle;

    /**
     * length of the UUID list to be used while advertising
     */
    uint8_t advtServUUIDlen;

    /**
     * the UUID list to be used while advertising
     */
    uint8_t advtServUUID[100];

} BleGlobalContext_t;

typedef struct
{
    BleGlobalContext_t BleApplicationContext_legacy;
    APP_BLE_ConnStatus_t Device_Connection_Status;
    uint8_t SwitchOffGPIO_timer_Id;
} BleApplicationContext_t;
/* USER CODE BEGIN PTD */

/* USER CODE END PTD */

/* Private defines -----------------------------------------------------------*/
#define APPBLE_GAP_DEVICE_NAME_LENGTH 7
#define FAST_ADV_TIMEOUT (30 * 1000 * 1000 / CFG_TS_TICK_VAL)   /**< 30s */
#define INITIAL_ADV_TIMEOUT (1 * 1000 * 1000 / CFG_TS_TICK_VAL) /**< 60s */

#define BD_ADDR_SIZE_LOCAL 6

/* USER CODE BEGIN PD */
#define LED_ON_TIMEOUT (0.005 * 1000 * 1000 / CFG_TS_TICK_VAL) /**< 5ms */
/* USER CODE END PD */

/* Private macro -------------------------------------------------------------*/
/* USER CODE BEGIN PM */

/* USER CODE END PM */

/* Private variables ---------------------------------------------------------*/
PLACE_IN_SECTION("MB_MEM1") ALIGN(4) static TL_CmdPacket_t BleCmdBuffer;

static const uint8_t M_bd_addr[BD_ADDR_SIZE_LOCAL] = {
    (uint8_t) ((CFG_ADV_BD_ADDRESS & 0x0000000000FF)),       (uint8_t) ((CFG_ADV_BD_ADDRESS & 0x00000000FF00) >> 8),
    (uint8_t) ((CFG_ADV_BD_ADDRESS & 0x000000FF0000) >> 16), (uint8_t) ((CFG_ADV_BD_ADDRESS & 0x0000FF000000) >> 24),
    (uint8_t) ((CFG_ADV_BD_ADDRESS & 0x00FF00000000) >> 32), (uint8_t) ((CFG_ADV_BD_ADDRESS & 0xFF0000000000) >> 40)
};
static uint8_t bd_addr_udn[BD_ADDR_SIZE_LOCAL];

/**
 *   Identity root key used to derive IRK and DHK(Legacy)
 */
static const uint8_t BLE_CFG_IR_VALUE[16] = CFG_BLE_IR;

/**
 * Encryption root key used to derive LTK(Legacy) and CSRK
 */
static const uint8_t BLE_CFG_ER_VALUE[16] = CFG_BLE_ER;

static BleApplicationContext_t BleApplicationContext;
static uint16_t AdvIntervalMin, AdvIntervalMax;

MATTER_App_Notification_evt_t handleNotification;

#if L2CAP_REQUEST_NEW_CONN_PARAM != 0
#define SIZE_TAB_CONN_INT 2
float tab_conn_interval[SIZE_TAB_CONN_INT] = { 50, 1000 }; /* ms */
uint8_t index_con_int, mutex;
#endif

/**
 * Advertising Data
 */
static const char local_name[] = { AD_TYPE_COMPLETE_LOCAL_NAME, 'S', 'T', 'D', 'K', 'M', 'A', 'T', 'T', 'E', 'R' };
uint8_t manuf_data[15]         = {
    0x02, 0x01, 0x06, 0x0B, 0x16, 0xF6, 0xFF, 0x00, 0x00, 0x0F, 0xF1, 0xFF, 0x04, 0x80, 0x00,
};

/* USER CODE BEGIN PV */

/* USER CODE END PV */

/* Global variables ----------------------------------------------------------*/
osMutexId_t MtxHciId;
osSemaphoreId_t SemHciId;
osThreadId_t HciUserEvtProcessId;
#if (L2CAP_REQUEST_NEW_CONN_PARAM != 0)
osThreadId_t ConnIntUpdateReqProcessId;
#endif

