project-chip/connectedhomeip/examples/platform/stm32/common/STM32WB5MM-DK/STM32_WPAN/App/app_ble.c
const osThreadAttr_t HciUserEvtProcess_attr = { .name       = CFG_HCI_USER_EVT_PROCESS_NAME,
                                                .attr_bits  = CFG_HCI_USER_EVT_PROCESS_ATTR_BITS,
                                                .cb_mem     = CFG_HCI_USER_EVT_PROCESS_CB_MEM,
                                                .cb_size    = CFG_HCI_USER_EVT_PROCESS_CB_SIZE,
                                                .stack_mem  = CFG_HCI_USER_EVT_PROCESS_STACK_MEM,
                                                .priority   = CFG_HCI_USER_EVT_PROCESS_PRIORITY,
                                                .stack_size = CFG_HCI_USER_EVT_PROCESS_STACK_SIZE };

#if (L2CAP_REQUEST_NEW_CONN_PARAM != 0)
const osThreadAttr_t ConnIntUpdateReqProcess_attr = { .name       = CFG_CONN_INT_UPD_REQ_PROCESS_NAME,
                                                      .attr_bits  = CFG_CONN_INT_UPD_REQ_PROCESS_ATTR_BITS,
                                                      .cb_mem     = CFG_CONN_INT_UPD_REQ_PROCESS_CB_MEM,
                                                      .cb_size    = CFG_CONN_INT_UPD_REQ_PROCESS_CB_SIZE,
                                                      .stack_mem  = CFG_CONN_INT_UPD_REQ_PROCESS_STACK_MEM,
                                                      .priority   = CFG_CONN_INT_UPD_REQ_PROCESS_PRIORITY,
                                                      .stack_size = CFG_CONN_INT_UPD_REQ_PROCESS_STACK_SIZE };
#endif

/* Private function prototypes -----------------------------------------------*/
static void BLE_UserEvtRx(void * pPayload);
static void BLE_StatusNot(HCI_TL_CmdStatus_t status);
static void Ble_Tl_Init(void);
static void Ble_Hci_Gap_Gatt_Init(void);
static const uint8_t * BleGetBdAddress(void);
static void HciUserEvtProcess(void * argument);
static void Switch_OFF_GPIO(void);
#if (L2CAP_REQUEST_NEW_CONN_PARAM != 0)
static void ConnIntUpdateReqProcess(void * argument);
static void BLE_SVC_L2CAP_Conn_Update(uint16_t Connection_Handle);
#endif

/* USER CODE BEGIN PFP */

/* USER CODE END PFP */

/* Functions Definition ------------------------------------------------------*/
void APP_BLE_Init_Dyn_1(void)
{
    /* USER CODE BEGIN APP_BLE_Init_1 */

    /* USER CODE END APP_BLE_Init_1 */

    SHCI_C2_Ble_Init_Cmd_Packet_t ble_init_cmd_packet = { { { 0, 0, 0 } }, /**< Header unused */
                                                          { 0,             /** pBleBufferAddress not used */
                                                            0,             /** BleBufferSize not used */
                                                            CFG_BLE_NUM_GATT_ATTRIBUTES,
                                                            CFG_BLE_NUM_GATT_SERVICES,
                                                            CFG_BLE_ATT_VALUE_ARRAY_SIZE,
                                                            CFG_BLE_NUM_LINK,
                                                            CFG_BLE_DATA_LENGTH_EXTENSION,
                                                            CFG_BLE_PREPARE_WRITE_LIST_SIZE,
                                                            CFG_BLE_MBLOCK_COUNT,
                                                            CFG_BLE_MAX_ATT_MTU,
                                                            CFG_BLE_PERIPHERAL_SCA,
                                                            CFG_BLE_CENTRAL_SCA,
                                                            CFG_BLE_LS_SOURCE,
                                                            CFG_BLE_MAX_CONN_EVENT_LENGTH,
                                                            CFG_BLE_HSE_STARTUP_TIME,
                                                            CFG_BLE_VITERBI_MODE,
                                                            CFG_BLE_OPTIONS,
                                                            0,
                                                            CFG_BLE_MAX_COC_INITIATOR_NBR,
                                                            CFG_BLE_MIN_TX_POWER,
                                                            CFG_BLE_MAX_TX_POWER } };

    /**
     * Initialize Ble Transport Layer
     */
    Ble_Tl_Init();

    /**
     * Do not allow standby in the application
     */
    UTIL_LPM_SetOffMode(1 << CFG_LPM_APP_BLE, UTIL_LPM_DISABLE);

    /**
     * Register the hci transport layer to handle BLE User Asynchronous Events
     */
    HciUserEvtProcessId = osThreadNew(HciUserEvtProcess, NULL, &HciUserEvtProcess_attr);

    /**
     * Starts the BLE Stack on CPU2
     */
    SHCI_C2_BLE_Init(&ble_init_cmd_packet);

    /**
     * Initialization of HCI & GATT & GAP layer
     */
    Ble_Hci_Gap_Gatt_Init();

    /**
     * Initialization of the BLE Services
     */
    SVCCTL_Init();

    /**
     * Initialization of the BLE App Context
     */
    BleApplicationContext.Device_Connection_Status                      = APP_BLE_IDLE;
    BleApplicationContext.BleApplicationContext_legacy.connectionHandle = 0xFFFF;

    /**
     * Initialization of ADV - Ad Manufacturer Element - Support OTA Bit Mask
     */
#if (RADIO_ACTIVITY_EVENT != 0)
    aci_hal_set_radio_activity_mask(0x0006);
#endif

#if (L2CAP_REQUEST_NEW_CONN_PARAM != 0)
    ConnIntUpdateReqProcessId = osThreadNew(ConnIntUpdateReqProcess, NULL, &ConnIntUpdateReqProcess_attr);

    index_con_int = 0;
    mutex         = 1;
#endif
    /**
     * Initialize Matter  Application
     */
    APP_MATTER_Init();

    return;
}

void APP_BLE_Init_Dyn_2(void)
{
    /**
     * Make device discoverable
     */
    BleApplicationContext.BleApplicationContext_legacy.advtServUUID[0] = NULL;
    BleApplicationContext.BleApplicationContext_legacy.advtServUUIDlen = 0;
    /* Initialize intervals for reconnexion without intervals update */
    AdvIntervalMin = CFG_FAST_CONN_ADV_INTERVAL_MIN;
    AdvIntervalMax = CFG_FAST_CONN_ADV_INTERVAL_MAX;

    /**
     * Start to Advertise to be connected by P2P Client
     */
#if (CFG_LPM_SUPPORTED == 1)
    APP_BLE_Adv_Request(APP_BLE_LP_ADV);
#endif
    /* USER CODE BEGIN APP_BLE_Init_2 */

    /* USER CODE END APP_BLE_Init_2 */
    return;
}

SVCCTL_UserEvtFlowStatus_t SVCCTL_App_Notification(void * pckt)
{
    hci_event_pckt * event_pckt;
    evt_le_meta_event * meta_evt;
    event_pckt = (hci_event_pckt *) ((hci_uart_pckt *) pckt)->data;

    switch (event_pckt->evt)
    {
    case HCI_DISCONNECTION_COMPLETE_EVT_CODE: {
        hci_disconnection_complete_event_rp0 * disconnection_complete_event;
        disconnection_complete_event = (hci_disconnection_complete_event_rp0 *) event_pckt->data;

        if (disconnection_complete_event->Connection_Handle == BleApplicationContext.BleApplicationContext_legacy.connectionHandle)
        {
            BleApplicationContext.BleApplicationContext_legacy.connectionHandle = 0;
            BleApplicationContext.Device_Connection_Status                      = APP_BLE_IDLE;
            APP_DBG_MSG("\r\n\r** DISCONNECTION EVENT WITH CLIENT \n");
        }
        /*
         * SPECIFIC to P2P Server APP
         */
        handleNotification.P2P_Evt_Opcode   = MATTER_STM_PEER_DISCON_HANDLE_EVT;
        handleNotification.ConnectionHandle = disconnection_complete_event->Connection_Handle;
        APP_MATTER_Notification(&handleNotification);

        /* USER CODE BEGIN EVT_DISCONN_COMPLETE */

        /* USER CODE END EVT_DISCONN_COMPLETE */
    }

    break; /* EVT_DISCONN_COMPLETE */

    case HCI_LE_META_EVT_CODE: {
        meta_evt = (evt_le_meta_event *) event_pckt->data;
        /* USER CODE BEGIN EVT_LE_META_EVENT */

        /* USER CODE END EVT_LE_META_EVENT */
        switch (meta_evt->subevent)
        {
        case HCI_LE_CONNECTION_UPDATE_COMPLETE_SUBEVT_CODE:
            APP_DBG_MSG("\r\n\r** CONNECTION UPDATE EVENT WITH CLIENT \n");

            /**
             * The connection is done, there is no need anymore to schedule the LP ADV
             */
            break;
        case HCI_LE_CONNECTION_COMPLETE_SUBEVT_CODE: {
            hci_le_connection_complete_event_rp0 * connection_complete_event;

            /**
             * The connection is done, there is no need anymore to schedule the LP ADV
             */
            connection_complete_event = (hci_le_connection_complete_event_rp0 *) meta_evt->data;

            APP_DBG_MSG("EVT_LE_CONN_COMPLETE for connection handle 0x%x\n", connection_complete_event->Connection_Handle);

            if (BleApplicationContext.Device_Connection_Status == APP_BLE_LP_CONNECTING)
            {
                /* Connection as client */
                BleApplicationContext.Device_Connection_Status = APP_BLE_CONNECTED_CLIENT;
            }
            else
            {
                /* Connection as server */
                BleApplicationContext.Device_Connection_Status = APP_BLE_CONNECTED_SERVER;
            }

            BleApplicationContext.BleApplicationContext_legacy.connectionHandle = connection_complete_event->Connection_Handle;

            /** SPECIFIC to P2P Server APP*/
            hci_le_set_data_length(BleApplicationContext.BleApplicationContext_legacy.connectionHandle, 251, 2120);
            handleNotification.P2P_Evt_Opcode   = MATTER_STM_PEER_CONN_HANDLE_EVT;
            handleNotification.ConnectionHandle = BleApplicationContext.BleApplicationContext_legacy.connectionHandle;
            APP_MATTER_Notification(&handleNotification);
            /**/
            /* USER CODE END HCI_EVT_LE_CONN_COMPLETE */
        }
        break; /* HCI_EVT_LE_CONN_COMPLETE */

        default:
            /* USER CODE BEGIN SUBEVENT_DEFAULT */
            /* USER CODE END SUBEVENT_DEFAULT */
            break;
        }
    }
    break; /* HCI_EVT_LE_META_EVENT */
    default:
        /* USER CODE BEGIN ECODE_DEFAULT*/

        /* USER CODE END ECODE_DEFAULT*/
        break;
    }

    return (SVCCTL_UserEvtFlowEnable);
}

APP_BLE_ConnStatus_t APP_BLE_Get_Server_Connection_Status(void)
{
    return BleApplicationContext.Device_Connection_Status;
}

/* USER CODE BEGIN FD*/
void APP_BLE_Key_Button1_Action(void) {}

void APP_BLE_Key_Button2_Action(void)
{
#if (L2CAP_REQUEST_NEW_CONN_PARAM != 0)
    osThreadFlagsSet(ConnIntUpdateReqProcessId, 1);
#endif
}

