project-chip/connectedhomeip/examples/platform/stm32/common/STM32WB5MM-DK/STM32_WPAN/App/app_ble.c
void APP_BLE_Key_Button3_Action(void) {}

void APP_BLE_Stop(void)
{

    /* BLE STOP Procedure */
    aci_hal_stack_reset();
}
/* USER CODE END FD*/
/*************************************************************
 *
 * LOCAL FUNCTIONS
 *
 *************************************************************/
static void Ble_Tl_Init(void)
{
    HCI_TL_HciInitConf_t Hci_Tl_Init_Conf;

    MtxHciId                           = osMutexNew(NULL);
    SemHciId                           = osSemaphoreNew(1, 0, NULL); /*< Create the semaphore and make it busy at initialization */
    Hci_Tl_Init_Conf.p_cmdbuffer       = (uint8_t *) &BleCmdBuffer;
    Hci_Tl_Init_Conf.StatusNotCallBack = BLE_StatusNot;
    hci_init(BLE_UserEvtRx, (void *) &Hci_Tl_Init_Conf);

    return;
}

static void Ble_Hci_Gap_Gatt_Init(void)
{

    uint8_t role;
    uint8_t index;
    uint16_t gap_service_handle, gap_dev_name_char_handle, gap_appearance_char_handle;
    const uint8_t * bd_addr;
    uint32_t srd_bd_addr[2];
    uint16_t appearance[1] = { BLE_CFG_GAP_APPEARANCE };

    /**
     * Initialize HCI layer
     */
    /*HCI Reset to synchronise BLE Stack*/
    hci_reset();

    /**
     * Write the BD Address
     */

    bd_addr = BleGetBdAddress();
    aci_hal_write_config_data(CONFIG_DATA_PUBADDR_OFFSET, CONFIG_DATA_PUBADDR_LEN, (uint8_t *) bd_addr);

    /* BLE MAC in ADV Packet */
    // manuf_data[ sizeof(manuf_data)-6] = bd_addr[5];
    // manuf_data[ sizeof(manuf_data)-5] = bd_addr[4];
    // manuf_data[ sizeof(manuf_data)-4] = bd_addr[3];
    // manuf_data[ sizeof(manuf_data)-3] = bd_addr[2];
    // manuf_data[ sizeof(manuf_data)-2] = bd_addr[1];
    // manuf_data[ sizeof(manuf_data)-1] = bd_addr[0];

    /**
     * Static random Address
     * The two upper bits shall be set to 1
     * The lowest 32bits is read from the UDN to differentiate between devices
     * The RNG may be used to provide a random number on each power on
     */
    srd_bd_addr[1] = 0x0000ED6E;
    srd_bd_addr[0] = LL_FLASH_GetUDN();
    aci_hal_write_config_data(CONFIG_DATA_RANDOM_ADDRESS_OFFSET, CONFIG_DATA_RANDOM_ADDRESS_LEN, (uint8_t *) srd_bd_addr);

    /**
     * Write Identity root key used to derive IRK and DHK(Legacy)
     */
    aci_hal_write_config_data(CONFIG_DATA_IR_OFFSET, CONFIG_DATA_IR_LEN, (uint8_t *) BLE_CFG_IR_VALUE);

    /**
     * Write Encryption root key used to derive LTK and CSRK
     */
    aci_hal_write_config_data(CONFIG_DATA_ER_OFFSET, CONFIG_DATA_ER_LEN, (uint8_t *) BLE_CFG_ER_VALUE);

    /**
     * Set TX Power to 0dBm.
     */
    aci_hal_set_tx_power_level(1, CFG_TX_POWER);

    /**
     * Initialize GATT interface
     */
    aci_gatt_init();

    /**
     * Initialize GAP interface
     */
    role = 0;

#if (BLE_CFG_PERIPHERAL == 1)
    role |= GAP_PERIPHERAL_ROLE;
#endif

#if (BLE_CFG_CENTRAL == 1)
    role |= GAP_CENTRAL_ROLE;
#endif

    if (role > 0)
    {
        const char * name = "STM32WB";
        aci_gap_init(role, 0, APPBLE_GAP_DEVICE_NAME_LENGTH, &gap_service_handle, &gap_dev_name_char_handle,
                     &gap_appearance_char_handle);

        if (aci_gatt_update_char_value(gap_service_handle, gap_dev_name_char_handle, 0, strlen(name), (uint8_t *) name))
        {
            BLE_DBG_SVCCTL_MSG("Device Name aci_gatt_update_char_value failed.\n");
        }
    }

    if (aci_gatt_update_char_value(gap_service_handle, gap_appearance_char_handle, 0, 2, (uint8_t *) &appearance))
    {
        BLE_DBG_SVCCTL_MSG("Appearance aci_gatt_update_char_value failed.\n");
    }
    /**
     * Initialize Default PHY
     */
    hci_le_set_default_phy(ALL_PHYS_PREFERENCE, TX_2M_PREFERRED, RX_2M_PREFERRED);

    /**
     * Initialize IO capability
     */
    BleApplicationContext.BleApplicationContext_legacy.bleSecurityParam.ioCapability = CFG_IO_CAPABILITY;
    aci_gap_set_io_capability(BleApplicationContext.BleApplicationContext_legacy.bleSecurityParam.ioCapability);

    /**
     * Initialize authentication
     */
    BleApplicationContext.BleApplicationContext_legacy.bleSecurityParam.mitm_mode            = CFG_MITM_PROTECTION;
    BleApplicationContext.BleApplicationContext_legacy.bleSecurityParam.OOB_Data_Present     = 0;
    BleApplicationContext.BleApplicationContext_legacy.bleSecurityParam.encryptionKeySizeMin = 8;
    BleApplicationContext.BleApplicationContext_legacy.bleSecurityParam.encryptionKeySizeMax = 16;
    BleApplicationContext.BleApplicationContext_legacy.bleSecurityParam.Use_Fixed_Pin        = 1;
    BleApplicationContext.BleApplicationContext_legacy.bleSecurityParam.Fixed_Pin            = 111111;
    BleApplicationContext.BleApplicationContext_legacy.bleSecurityParam.bonding_mode         = 1;
    for (index = 0; index < 16; index++)
    {
        BleApplicationContext.BleApplicationContext_legacy.bleSecurityParam.OOB_Data[index] = (uint8_t) index;
    }

    aci_gap_set_authentication_requirement(BleApplicationContext.BleApplicationContext_legacy.bleSecurityParam.bonding_mode,
                                           BleApplicationContext.BleApplicationContext_legacy.bleSecurityParam.mitm_mode, 0, 0,
                                           BleApplicationContext.BleApplicationContext_legacy.bleSecurityParam.encryptionKeySizeMin,
                                           BleApplicationContext.BleApplicationContext_legacy.bleSecurityParam.encryptionKeySizeMax,
                                           BleApplicationContext.BleApplicationContext_legacy.bleSecurityParam.Use_Fixed_Pin,
                                           BleApplicationContext.BleApplicationContext_legacy.bleSecurityParam.Fixed_Pin, 0);

    /**
     * Initialize whitelist
     */
    if (BleApplicationContext.BleApplicationContext_legacy.bleSecurityParam.bonding_mode)
    {
        aci_gap_configure_whitelist();
    }
}

void APP_BLE_Adv_Request(APP_BLE_ConnStatus_t New_Status)
{
    tBleStatus ret = BLE_STATUS_INVALID_PARAMS;
    uint16_t Min_Inter, Max_Inter;

    if (New_Status == APP_BLE_FAST_ADV)
    {
        Min_Inter = AdvIntervalMin;
        Max_Inter = AdvIntervalMax;
    }
    else
    {
        Min_Inter = CFG_LP_CONN_ADV_INTERVAL_MIN;
        Max_Inter = CFG_LP_CONN_ADV_INTERVAL_MAX;
    }

