project-chip/connectedhomeip/examples/platform/stm32/common/STM32WB5MM-DK/STM32_WPAN/App/app_ble.c
    APP_DBG_MSG("First index in %d state \n", BleApplicationContext.Device_Connection_Status);

    if ((New_Status == APP_BLE_LP_ADV) &&
        ((BleApplicationContext.Device_Connection_Status == APP_BLE_FAST_ADV) ||
         (BleApplicationContext.Device_Connection_Status == APP_BLE_LP_ADV)))
    {
        /* Connection in ADVERTISE mode have to stop the current advertising */
        ret = aci_gap_set_non_discoverable();
        if (ret == BLE_STATUS_SUCCESS)
        {
            APP_DBG_MSG("Successfully Stopped Advertising");
        }
        else
        {
            APP_DBG_MSG("Stop Advertising Failed , result: %d \n", ret);
        }
    }

    BleApplicationContext.Device_Connection_Status = New_Status;
    /* Start Fast or Low Power Advertising */
    ret = aci_gap_set_discoverable(ADV_IND, Min_Inter, Max_Inter, GAP_PUBLIC_ADDR, NO_WHITE_LIST_USE, /* use white list */
                                   sizeof(local_name), (uint8_t *) &local_name,
                                   BleApplicationContext.BleApplicationContext_legacy.advtServUUIDlen,
                                   BleApplicationContext.BleApplicationContext_legacy.advtServUUID, 0, 0);
    /* Update Advertising data */
    ret = aci_gap_update_adv_data(sizeof(manuf_data), (uint8_t *) manuf_data);

    if (ret == BLE_STATUS_SUCCESS)
    {
        if (New_Status == APP_BLE_FAST_ADV)
        {
            APP_DBG_MSG("Successfully Start Fast Advertising \n");
        }
        else
        {
            APP_DBG_MSG("\n\rSuccessfully Start Low Power Advertising \n\r");
        }
    }
    else
    {
        if (New_Status == APP_BLE_FAST_ADV)
        {
            APP_DBG_MSG("Start Fast Advertising Failed , result: %d \n\r", ret);
        }
        else
        {
            APP_DBG_MSG("Start Low Power Advertising Failed , result: %d \n", ret);
        }
    }

    return;
}

const uint8_t * BleGetBdAddress(void)
{
    uint8_t * otp_addr;
    const uint8_t * bd_addr;
    uint32_t udn;
    uint32_t company_id;
    uint32_t device_id;

    udn = LL_FLASH_GetUDN();

    if (udn != 0xFFFFFFFF)
    {
        company_id = LL_FLASH_GetSTCompanyID();
        device_id  = LL_FLASH_GetDeviceID();

        /**
         * Public Address with the ST company ID
         * bit[47:24] : 24bits (OUI) equal to the company ID
         * bit[23:16] : Device ID.
         * bit[15:0] : The last 16bits from the UDN
         * Note: In order to use the Public Address in a final product, a dedicated
         * 24bits company ID (OUI) shall be bought.
         */
        bd_addr_udn[0] = (uint8_t) (udn & 0x000000FF);
        bd_addr_udn[1] = (uint8_t) ((udn & 0x0000FF00) >> 8);
        bd_addr_udn[2] = (uint8_t) device_id;
        bd_addr_udn[3] = (uint8_t) (company_id & 0x000000FF);
        ;
        bd_addr_udn[4] = (uint8_t) ((company_id & 0x0000FF00) >> 8);
        bd_addr_udn[5] = (uint8_t) ((company_id & 0x00FF0000) >> 16);

        bd_addr = (const uint8_t *) bd_addr_udn;
    }
    else
    {
        otp_addr = OTP_Read(0);
        if (otp_addr)
        {
            bd_addr = ((OTP_ID0_t *) otp_addr)->bd_address;
        }
        else
        {
            bd_addr = M_bd_addr;
        }
    }

    return bd_addr;
}

/* USER CODE BEGIN FD_LOCAL_FUNCTION */

/* USER CODE END FD_LOCAL_FUNCTION */

/*************************************************************
 *
 *SPECIFIC FUNCTIONS FOR P2P SERVER
 *
 *************************************************************/
void APP_BLE_Adv_Cancel(void)
{
    /* USER CODE BEGIN Adv_Cancel_1 */
    /* USER CODE END Adv_Cancel_1 */

    if (BleApplicationContext.Device_Connection_Status != APP_BLE_CONNECTED_SERVER)

    {

        tBleStatus result = 0x00;

        result = aci_gap_set_non_discoverable();

        BleApplicationContext.Device_Connection_Status = APP_BLE_IDLE;
        if (result == BLE_STATUS_SUCCESS)
        {
            APP_DBG_MSG("  \r\n\r");
            APP_DBG_MSG("** STOP ADVERTISING **  \r\n\r");
        }
        else
        {
            APP_DBG_MSG("** STOP ADVERTISING **  Failed \r\n\r");
        }
    }

    /* USER CODE BEGIN Adv_Cancel_2 */

    /* USER CODE END Adv_Cancel_2 */
    return;
}

static void Switch_OFF_GPIO()
{
    /* USER CODE BEGIN Switch_OFF_GPIO */
    /* USER CODE END Switch_OFF_GPIO */
}

#if (L2CAP_REQUEST_NEW_CONN_PARAM != 0)
void BLE_SVC_L2CAP_Conn_Update(uint16_t Connection_Handle)
{
    /* USER CODE BEGIN BLE_SVC_L2CAP_Conn_Update_1 */

    /* USER CODE END BLE_SVC_L2CAP_Conn_Update_1 */
    if (mutex == 1)
    {
        mutex                       = 0;
        index_con_int               = (index_con_int + 1) % SIZE_TAB_CONN_INT;
        uint16_t interval_min       = CONN_P(tab_conn_interval[index_con_int]);
        uint16_t interval_max       = CONN_P(tab_conn_interval[index_con_int]);
        uint16_t peripheral_latency = L2CAP_PERIPHERAL_LATENCY;
        uint16_t timeout_multiplier = L2CAP_TIMEOUT_MULTIPLIER;
        tBleStatus result;

        result = aci_l2cap_connection_parameter_update_req(BleApplicationContext.BleApplicationContext_legacy.connectionHandle,
                                                           interval_min, interval_max, peripheral_latency, timeout_multiplier);
        if (result == BLE_STATUS_SUCCESS)
        {
            APP_DBG_MSG("BLE_SVC_L2CAP_Conn_Update(), Successfully \r\n\r");
        }
        else
        {
            APP_DBG_MSG("BLE_SVC_L2CAP_Conn_Update(), Failed \r\n\r");
        }
    }
    /* USER CODE BEGIN BLE_SVC_L2CAP_Conn_Update_2 */

    /* USER CODE END BLE_SVC_L2CAP_Conn_Update_2 */
    return;
}

static void ConnIntUpdateReqProcess(void * argument)
{
    UNUSED(argument);
    for (;;)
    {
        osThreadFlagsWait(1, osFlagsWaitAny, osWaitForever);
        if (BleApplicationContext.Device_Connection_Status != APP_BLE_FAST_ADV &&
            BleApplicationContext.Device_Connection_Status != APP_BLE_IDLE)
        {
            BLE_SVC_L2CAP_Conn_Update(BleApplicationContext.BleApplicationContext_legacy.connectionHandle);
        }
    }
}
#endif

static void HciUserEvtProcess(void * argument)
{
    UNUSED(argument);

    for (;;)
    {
        osThreadFlagsWait(1, osFlagsWaitAny, osWaitForever);
        hci_user_evt_proc();
    }
}

/* USER CODE BEGIN FD_SPECIFIC_FUNCTIONS */

