project-chip/connectedhomeip/examples/platform/stm32/common/STM32WB5MM-DK/STM32_WPAN/App/app_ble.c
/* USER CODE END FD_SPECIFIC_FUNCTIONS */
/*************************************************************
 *
 * WRAP FUNCTIONS
 *
 *************************************************************/
void hci_notify_asynch_evt(void * pdata)
{
    UNUSED(pdata);

    osThreadFlagsSet(HciUserEvtProcessId, 1);

    return;
}

void hci_cmd_resp_release(uint32_t flag)
{
    UNUSED(flag);

    osSemaphoreRelease(SemHciId);

    return;
}

void hci_cmd_resp_wait(uint32_t timeout)
{
    UNUSED(timeout);

    osSemaphoreAcquire(SemHciId, osWaitForever);

    return;
}

static void BLE_UserEvtRx(void * pPayload)
{
    SVCCTL_UserEvtFlowStatus_t svctl_return_status;
    tHCI_UserEvtRxParam * p_param;

    p_param = (tHCI_UserEvtRxParam *) pPayload;

    svctl_return_status = SVCCTL_UserEvtRx((void *) &(p_param->pckt->evtserial));
    if (svctl_return_status != SVCCTL_UserEvtFlowDisable)
    {
        p_param->status = HCI_TL_UserEventFlow_Enable;
    }
    else
    {
        p_param->status = HCI_TL_UserEventFlow_Disable;
    }
}

static void BLE_StatusNot(HCI_TL_CmdStatus_t status)
{
    switch (status)
    {
    case HCI_TL_CmdBusy:
        /**
         * All tasks that may send an aci/hci commands shall be listed here
         * This is to prevent a new command is sent while one is already pending
         */
        osMutexAcquire(MtxHciId, osWaitForever);
        break;

    case HCI_TL_CmdAvailable:
        /**
         * All tasks that may send an aci/hci commands shall be listed here
         * This is to prevent a new command is sent while one is already pending
         */
        osMutexRelease(MtxHciId);
        break;

    default:
        break;
    }
    return;
}

void SVCCTL_ResumeUserEventFlow(void)
{
    hci_resume_flow();
    return;
}

/* USER CODE BEGIN FD_WRAP_FUNCTIONS */

/* USER CODE END FD_WRAP_FUNCTIONS */
